
function   Pos=Chan1(BS,R)
%函数的功能：基于Chan氏算法三站定位的函数
%函数的描述：输入三个台站的横纵坐标，已经测量到个各站到信号源站的距离差，就可以估计出信号源站的位置
%函数的使用：Pos=Chan1(BS,R)
%输入：
%     BS:三个台站的横纵坐标,每行代表一个接收站坐标
%     R:测量到个各站到信号源站的距离差
%输出：
%     Pos:估计出信号源站的位置的横纵坐标,会存在两组坐标，需要利用先验知识进行取舍。
%例子：无;
%注意事项：利用函数的适用范围。
%文档日期：~
%标签：~
%创建日期：~
%最后更新日期：~

X1=BS(1,:)';
P1=zeros(2,2);
P1(1,:) = BS(2,:)-BS(1,:);
P1(2,:) = BS(3,:)-BS(1,:);
P1 = -inv(P1);
P2 = R;
K = zeros(3,1);
for i =1:3
	K(i) = BS(i,1).^2+BS(i,2).^2;
end
P3 = zeros(2,1);
P3(1) = -K(2)+K(1)+R(1)^2;
P3(2) = -K(3)+K(1)+R(2)^2;
P3= P3./2;

a = (P1*P2)'*(P1*P2)-1;
b = (P1*P2)'*(P1*P3-X1)+(P1*P3-X1)'*(P1*P2);
c = (P1*P3-X1)'*(P1*P3-X1);
r1 = (-b+sqrt(b^2-4*a*c))/(2*a);
r2 = (-b-sqrt(b^2-4*a*c))/(2*a);
Pos = zeros(2,2);
Pos(:,1) = P1*P2*r1+P1*P3;
Pos(:,2) = P1*P2*r2+P1*P3;
Pos = Pos';
end